package com.example.quiiiiizzzz;

public class QuestionAnswer {

    public static String question[] = {
            "Какого цвета мои глаза?",
            "Кто я по знаку зодиака?",
            "Мой любимый напиток?",
            "Какая у меня любимая компьютерная игра?",
            "Как зовут мою маму?",
            "Как зовут моего отца?",
            "Сколько у меня родных братьев?",
            "На что у меня аллергия?",
            "Какой у меня любимый цвет?",
            "Какое у меня зрение?",
            "Какой у меня любимый фрукт?",
            "Какой у меня был любимый предмет в школе?",
            "Какая у меня любимая пора года?",
            "Какое у меня любимое аниме?",
            "Когда у меня День Рождения?",
            "Какой у меня любимый музыкальный исполнитель?",
            "Каким спортом я занимался в детстве?",
            "Какой у меня айфон?"
    };

    public static String choices [][] = {
            {"Зеленые","Голубые","Коричневые","Фиолетовые"},
            {"Скорпион","Рак","Стрелец","Весы"},
            {"Кофе", "Чай", "Сок","Вода"},
            {"Genshin Impact","CS:GO","DOTA 2","Minecraft"},
            {"Екатерина","Елена","Анна","Евгения"},
            {"Кирилл", "Евгений","Виталий","Олег"},
            {"0","1","2","3"},
            {"Томаты","Пыль","Молоко","Пыльца"},
            {"Оранжевый", "Коричневый","Желтый","Фиолетовый"},
            {"1.0/1.0", "-2/-2.25","-3.75/-4.0","-2.25/-2.5"},
            {"Банан", "Апельсин", "Яблоко" ,"Персик"},
            {"Математика", "Физкультура", "Физика" ,"Литература"},
            {"Зима", "Весна", "Осень" ,"Лето"},
            {"Naruto", "Tokyo Ghoul", "Hunter x Hunter" ,"Demon Slayer"},
            {"26-го апреля", "3-го декабря", "8-го июля" ,"14-го ноября"},
            {"Lil Peep", "Yeat", "XXXTentacion" ,"Juice WRLD"},
            {"Футбол", "Баскетбол", "Теннис" ,"Плавание"},
            {"Iphone X", "Iphone SE PRO", "Iphone 11" ,"Iphone 12"}
    };

    public static String correctAnswers[] = {
            "Голубые",
            "Стрелец",
            "Вода",
            "Genshin Impact",
            "Евгения",
            "Виталий",
            "0",
            "Пыль",
            "Коричневый",
            "-3.75/-4.0",
            "Яблоко",
            "Литература",
            "Зима",
            "Hunter x Hunter",
            "3-го декабря",
            "Yeat",
            "Теннис",
            "Iphone 11"
    };
}

